# ფუნქცია არის კოდის ბლოკი, რომელსაც შეუძლია კონკრეტული ამოცანის შესრულება.
# ფუნქციის გამოყენებით შეგვიძლია კოდი გავხადოთ მრავალჯერ გამოყენებადი, მარტივად წასაკითხი და ორგანიზებული.

# აქ ვქმნით ფუნქციას სახელად greet, რომელსაც აქვს ერთი პარამეტრი სახელად name.
def greet(name):
    # ეს ფუნქცია ბეჭდავს მისალმებას და გადმოცემულ სახელს.
    print("Hello", name)

# პარამეტრი (parameter) — ეს არის ცვლადი, რომელიც განვსაზღვრავთ ფუნქციის აღწერისას.
# ჩვენს მაგალითში name არის პარამეტრი.

# არგუმენტი (argument) — ეს არის კონკრეტული მნიშვნელობა, რომელსაც ფუნქციას ვაწვდით გამოძახებისას.
# ქვემოთ როცა ვიძახებთ greet("Nino"), "Nino" არის არგუმენტი.
greet("Nino")  # გამოყოფს: Hello Nino
greet("Giorgi")  # გამოყოფს: Hello Giorgi

def equation(x):
    print(x + 5)

equation(10)