def get_the_vowels(word):
    # ვქმნით ცვლადს 'vowels', რომელიც შეიცავს ხმოვან ასოებს: a, e, i, o, u
    vowels = 'aeiou'
    
    # ვქმნით ცვლადს 'next_vowel', რომელიც განსაზღვრავს რომელ ხმოვან ასოს ველოდებით შემდეგ
    # თავდაპირველად ველოდებით 'a'
    next_vowel = 'a'
    
    # ვქმნით 'count' ცვლადს, რომელიც დაითვლის რამდენი რიგრიგობით მომდევნო ხმოვანი იყო სიტყვაში
    count = 0
    
    # ვიწყებთ სიტყვაზე წაკითხვას, თითოეულ ასოზე ციკლით
    for char in word:
        # შემოწმება: თუ მიმდინარე ასო ემთხვევა 'next_vowel'-ს
        if char == next_vowel:
            # თუ ემთხვევა, ვამატებთ 1-ს 'count'-ს
            count += 1
            
            # შემდეგი მომდევნო ხმოვანი განსაზღვრა
            # თუ 'next_vowel' იყო 'u', ვბრუნდებით 'a'-ზე, რომ  ისევ დაიწყოს
            if next_vowel == 'u':
                next_vowel = 'a'
            else: 
                # თუ არა, ვიღებთ 'next_vowel'-ის ადგილს 'vowels' სივიწმეში
                # და ვმოძებნით მომდევნო ხმოვან ასოს
                next_vowel = vowels[vowels.index(next_vowel) + 1]
    
    # ციკლის დასრულების შემდეგ ვაბრუნებთ 'count'-ს, ანუ რამდენი ხაზი მომდევნო ხმოვანებს შეესაბამებოდა
    return count
