Name = "Nino"
print("Hello, my name is " + Name + ".") #პრინტ ბრძანება - ეკრანზე (იგივე ტერმინალზე) გამოაქვს ინფორმაცია, რასაც ვუთითებთ ფრჩხილებში. ეს შეიძლება იყოს ტექსტი, რიცხვი, ცვლადი.

Num1 = 10 #ცვლადი - ეს არის სახელი, რომლითაც ვინახავთ მონაცემებს (მაგ. რიცხვი, ტექსტი, ლოგიკური მნიშვნელობა და ა.შ.)
Num2 = 5

print(Num1 + Num2)
print(Num1 - Num2) #ცვლადები გვაძლევს საშუალებას მოვათავსოთ მონაცემები ერტ "სათავსში" და შემდეგ გამოვიყენოთ რამდენჯერაც დაგვჭირდება, ისე რომ თავიდან არ მოგვიწიოს იგივე მნიშვნელობის წერა/განმეორება.