def to_weird_case(words):
    # სიტყვების სერიას(space-ით გამიჯნულ სტრინგს) ვყოფთ სიის ელემენტებად
    words = words.split(" ")
    
    # აქ შევქმნით სიას, სადაც შევინახავთ შეცვლილ სიტყვებს
    result = []
    
    # თითოეულ სიტყვაზე გადავივლით ციკლით
    for word in words:
        # აქ შევინახავთ ცვლილი სიტყვისთვის weird caseს ფორმატში
        weird = ''
        
        # ვახდენთ იტერაციას თითოეული ასოს ინდექსზე
        for i in range(len(word)):
            # თუ ინდექსი ლუწია, ასოს გარდავქმნით აფერქეისად
            if i % 2 == 0:
                weird += word[i].upper()
            # თუ ინდექსი კენტია, ასოს გარდავქმნით ლოუერქეისად
            else:
                weird += word[i].lower()
        
        # შევინახავთ ცვლილ სიტყვას საბოლოო სიაში
        result.append(weird)
    
    # სიის ელემენტებს ვრთავთ(space-ით) და ვაბრუნებთ საბოლოო სტრინგს
    return " ".join(result)
